Revit 2024 API
Rectangle Constructor (Rectangle)
 Constructs a new copy of the input ScreenRectangle object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Rectangle(
	Rectangle other
)
Visual Basic
Public Sub New ( _
	other As Rectangle _
)
Visual C++
public:
Rectangle(
	Rectangle^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Rectangle
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Rectangle Class
Rectangle Overload
Autodesk.Revit.DB Namespace